window.GEO_DATA = window.GEO_DATA || {};
window.GEO_DATA.lines = [
  {
    "id": "changbaishan",
    "name": "长白山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2753,
        "y": 440
      },
      {
        "x": 2721,
        "y": 481
      },
      {
        "x": 2697,
        "y": 513
      },
      {
        "x": 2677,
        "y": 540
      },
      {
        "x": 2653,
        "y": 569
      },
      {
        "x": 2626,
        "y": 603
      },
      {
        "x": 2605,
        "y": 629
      },
      {
        "x": 2576,
        "y": 661
      },
      {
        "x": 2556,
        "y": 688
      },
      {
        "x": 2534,
        "y": 714
      },
      {
        "x": 2517,
        "y": 745
      },
      {
        "x": 2494,
        "y": 767
      },
      {
        "x": 2467,
        "y": 791
      },
      {
        "x": 2450,
        "y": 817
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2753,
      "y": 420
    }
  },
  {
    "id": "daxinganling",
    "name": "大兴安岭",
    "description": "这是大兴安岭",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2307,
        "y": 163
      },
      {
        "x": 2305,
        "y": 195
      },
      {
        "x": 2305,
        "y": 227
      },
      {
        "x": 2299,
        "y": 272
      },
      {
        "x": 2295,
        "y": 308
      },
      {
        "x": 2288,
        "y": 350
      },
      {
        "x": 2288,
        "y": 406
      },
      {
        "x": 2281,
        "y": 439
      },
      {
        "x": 2267,
        "y": 485
      },
      {
        "x": 2247,
        "y": 532
      },
      {
        "x": 2228,
        "y": 569
      },
      {
        "x": 2212,
        "y": 613
      },
      {
        "x": 2186,
        "y": 644
      },
      {
        "x": 2169,
        "y": 672
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2307,
      "y": 143
    }
  },
  {
    "id": "xiaoxinganling",
    "name": "小兴安岭",
    "description": "这是小兴安岭",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2426,
        "y": 213
      },
      {
        "x": 2448,
        "y": 232
      },
      {
        "x": 2476,
        "y": 244
      },
      {
        "x": 2502,
        "y": 262
      },
      {
        "x": 2530,
        "y": 278
      },
      {
        "x": 2551,
        "y": 307
      },
      {
        "x": 2587,
        "y": 345
      },
      {
        "x": 2614,
        "y": 384
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2426,
      "y": 193
    }
  },
  {
    "id": "yanshan",
    "name": "燕山",
    "description": "燕山",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2224,
        "y": 804
      },
      {
        "x": 2255,
        "y": 805
      },
      {
        "x": 2300,
        "y": 805
      },
      {
        "x": 2332,
        "y": 808
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2224,
      "y": 784
    }
  },
  {
    "id": "altaishan",
    "name": "阿尔泰山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 844,
        "y": 268
      },
      {
        "x": 863,
        "y": 314
      },
      {
        "x": 894,
        "y": 337
      },
      {
        "x": 926,
        "y": 373
      },
      {
        "x": 964,
        "y": 419
      },
      {
        "x": 1007,
        "y": 445
      },
      {
        "x": 1058,
        "y": 479
      },
      {
        "x": 1104,
        "y": 500
      },
      {
        "x": 1137,
        "y": 520
      },
      {
        "x": 1171,
        "y": 529
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 844,
      "y": 248
    }
  },
  {
    "id": "tianshan",
    "name": "天山",
    "description": "天山",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 535,
        "y": 625
      },
      {
        "x": 670,
        "y": 626
      },
      {
        "x": 812,
        "y": 632
      },
      {
        "x": 883,
        "y": 638
      },
      {
        "x": 988,
        "y": 669
      },
      {
        "x": 1110,
        "y": 692
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 535,
      "y": 605
    }
  },
  {
    "id": "item_22826_34892_23665_33033",
    "name": "太行山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2060,
        "y": 869
      },
      {
        "x": 2044,
        "y": 921
      },
      {
        "x": 2027,
        "y": 984
      },
      {
        "x": 2015,
        "y": 1038
      },
      {
        "x": 2011,
        "y": 1068
      },
      {
        "x": 2001,
        "y": 1109
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2060,
      "y": 849
    }
  },
  {
    "id": "item_38452_23665_23665_33033",
    "name": "阴山山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1683,
        "y": 802
      },
      {
        "x": 1716,
        "y": 803
      },
      {
        "x": 1758,
        "y": 812
      },
      {
        "x": 1789,
        "y": 809
      },
      {
        "x": 1821,
        "y": 802
      },
      {
        "x": 1851,
        "y": 808
      },
      {
        "x": 1879,
        "y": 810
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1683,
      "y": 782
    }
  },
  {
    "id": "helanshan",
    "name": "贺兰山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1676,
        "y": 900
      },
      {
        "x": 1663,
        "y": 951
      },
      {
        "x": 1646,
        "y": 993
      },
      {
        "x": 1630,
        "y": 1020
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1676,
      "y": 880
    }
  },
  {
    "id": "item_31041_36830_23665_33033",
    "name": "祁连山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1136,
        "y": 874
      },
      {
        "x": 1183,
        "y": 874
      },
      {
        "x": 1240,
        "y": 897
      },
      {
        "x": 1284,
        "y": 918
      },
      {
        "x": 1342,
        "y": 936
      },
      {
        "x": 1391,
        "y": 964
      },
      {
        "x": 1420,
        "y": 980
      },
      {
        "x": 1452,
        "y": 1010
      },
      {
        "x": 1495,
        "y": 1040
      },
      {
        "x": 1532,
        "y": 1056
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1136,
      "y": 854
    }
  },
  {
    "id": "arjinshan",
    "name": "阿尔金山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 661,
        "y": 925
      },
      {
        "x": 707,
        "y": 917
      },
      {
        "x": 750,
        "y": 908
      },
      {
        "x": 795,
        "y": 910
      },
      {
        "x": 847,
        "y": 895
      },
      {
        "x": 897,
        "y": 884
      },
      {
        "x": 944,
        "y": 892
      },
      {
        "x": 990,
        "y": 895
      },
      {
        "x": 1018,
        "y": 887
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 661,
      "y": 905
    }
  },
  {
    "id": "item_26118_20177_23665_33033",
    "name": "昆仑山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 173,
        "y": 828
      },
      {
        "x": 226,
        "y": 872
      },
      {
        "x": 279,
        "y": 918
      },
      {
        "x": 332,
        "y": 954
      },
      {
        "x": 394,
        "y": 987
      },
      {
        "x": 457,
        "y": 1016
      },
      {
        "x": 535,
        "y": 1026
      },
      {
        "x": 615,
        "y": 1049
      },
      {
        "x": 670,
        "y": 1055
      },
      {
        "x": 723,
        "y": 1055
      },
      {
        "x": 798,
        "y": 1071
      },
      {
        "x": 865,
        "y": 1085
      },
      {
        "x": 937,
        "y": 1094
      },
      {
        "x": 1003,
        "y": 1109
      },
      {
        "x": 1062,
        "y": 1104
      },
      {
        "x": 1115,
        "y": 1114
      },
      {
        "x": 1199,
        "y": 1122
      },
      {
        "x": 1255,
        "y": 1132
      },
      {
        "x": 1332,
        "y": 1150
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 173,
      "y": 808
    }
  },
  {
    "id": "gangdisi",
    "name": "冈底斯山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 312,
        "y": 1164
      },
      {
        "x": 378,
        "y": 1203
      },
      {
        "x": 429,
        "y": 1239
      },
      {
        "x": 480,
        "y": 1276
      },
      {
        "x": 546,
        "y": 1298
      },
      {
        "x": 604,
        "y": 1316
      },
      {
        "x": 643,
        "y": 1341
      },
      {
        "x": 693,
        "y": 1367
      },
      {
        "x": 729,
        "y": 1361
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 312,
      "y": 1144
    }
  },
  {
    "id": "item_21916_29595_25289_38597_23665",
    "name": "喜玛拉雅山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 115,
        "y": 1078
      },
      {
        "x": 163,
        "y": 1117
      },
      {
        "x": 200,
        "y": 1158
      },
      {
        "x": 235,
        "y": 1190
      },
      {
        "x": 262,
        "y": 1219
      },
      {
        "x": 289,
        "y": 1237
      },
      {
        "x": 309,
        "y": 1265
      },
      {
        "x": 344,
        "y": 1296
      },
      {
        "x": 371,
        "y": 1316
      },
      {
        "x": 417,
        "y": 1348
      },
      {
        "x": 454,
        "y": 1384
      },
      {
        "x": 485,
        "y": 1407
      },
      {
        "x": 528,
        "y": 1424
      },
      {
        "x": 575,
        "y": 1433
      },
      {
        "x": 605,
        "y": 1456
      },
      {
        "x": 648,
        "y": 1469
      },
      {
        "x": 703,
        "y": 1472
      },
      {
        "x": 749,
        "y": 1480
      },
      {
        "x": 778,
        "y": 1463
      },
      {
        "x": 837,
        "y": 1479
      },
      {
        "x": 913,
        "y": 1486
      },
      {
        "x": 986,
        "y": 1486
      },
      {
        "x": 1048,
        "y": 1480
      },
      {
        "x": 1080,
        "y": 1474
      },
      {
        "x": 1130,
        "y": 1474
      },
      {
        "x": 1163,
        "y": 1474
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 115,
      "y": 1058
    }
  },
  {
    "id": "hengduan",
    "name": "横断山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1205,
        "y": 1398
      },
      {
        "x": 1228,
        "y": 1461
      },
      {
        "x": 1261,
        "y": 1507
      },
      {
        "x": 1279,
        "y": 1555
      },
      {
        "x": 1288,
        "y": 1604
      },
      {
        "x": 1304,
        "y": 1661
      },
      {
        "x": 1315,
        "y": 1696
      },
      {
        "x": 1311,
        "y": 1735
      },
      {
        "x": 1330,
        "y": 1772
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1205,
      "y": 1378
    }
  },
  {
    "id": "tanggula",
    "name": "唐古拉山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 723,
        "y": 1194
      },
      {
        "x": 765,
        "y": 1196
      },
      {
        "x": 832,
        "y": 1213
      },
      {
        "x": 888,
        "y": 1234
      },
      {
        "x": 937,
        "y": 1253
      },
      {
        "x": 977,
        "y": 1266
      },
      {
        "x": 1028,
        "y": 1289
      },
      {
        "x": 1057,
        "y": 1305
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 723,
      "y": 1174
    }
  },
  {
    "id": "bayankela",
    "name": "巴颜喀拉山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1081,
        "y": 1144
      },
      {
        "x": 1117,
        "y": 1165
      },
      {
        "x": 1153,
        "y": 1181
      },
      {
        "x": 1197,
        "y": 1201
      },
      {
        "x": 1236,
        "y": 1216
      },
      {
        "x": 1284,
        "y": 1240
      },
      {
        "x": 1319,
        "y": 1259
      },
      {
        "x": 1347,
        "y": 1269
      },
      {
        "x": 1400,
        "y": 1286
      },
      {
        "x": 1436,
        "y": 1305
      },
      {
        "x": 1480,
        "y": 1316
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1081,
      "y": 1124
    }
  },
  {
    "id": "dabashan",
    "name": "大巴山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1525,
        "y": 1290
      },
      {
        "x": 1567,
        "y": 1302
      },
      {
        "x": 1604,
        "y": 1295
      },
      {
        "x": 1637,
        "y": 1301
      },
      {
        "x": 1673,
        "y": 1305
      },
      {
        "x": 1705,
        "y": 1305
      },
      {
        "x": 1739,
        "y": 1302
      },
      {
        "x": 1775,
        "y": 1308
      },
      {
        "x": 1821,
        "y": 1321
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1525,
      "y": 1270
    }
  },
  {
    "id": "qinling",
    "name": "秦岭",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1426,
        "y": 1171
      },
      {
        "x": 1486,
        "y": 1197
      },
      {
        "x": 1549,
        "y": 1211
      },
      {
        "x": 1578,
        "y": 1217
      },
      {
        "x": 1608,
        "y": 1220
      },
      {
        "x": 1649,
        "y": 1226
      },
      {
        "x": 1689,
        "y": 1229
      },
      {
        "x": 1736,
        "y": 1226
      },
      {
        "x": 1787,
        "y": 1229
      },
      {
        "x": 1837,
        "y": 1230
      },
      {
        "x": 1906,
        "y": 1233
      },
      {
        "x": 1949,
        "y": 1236
      },
      {
        "x": 1985,
        "y": 1239
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1426,
      "y": 1151
    }
  },
  {
    "id": "wushan",
    "name": "巫山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1937,
        "y": 1351
      },
      {
        "x": 1929,
        "y": 1388
      },
      {
        "x": 1922,
        "y": 1423
      },
      {
        "x": 1917,
        "y": 1453
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1937,
      "y": 1331
    }
  },
  {
    "id": "xuefengshan",
    "name": "雪峰山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1907,
        "y": 1510
      },
      {
        "x": 1894,
        "y": 1539
      },
      {
        "x": 1900,
        "y": 1568
      },
      {
        "x": 1890,
        "y": 1599
      },
      {
        "x": 1887,
        "y": 1635
      },
      {
        "x": 1880,
        "y": 1663
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1907,
      "y": 1490
    }
  },
  {
    "id": "nanling",
    "name": "南岭",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 1906,
        "y": 1730
      },
      {
        "x": 1940,
        "y": 1723
      },
      {
        "x": 1981,
        "y": 1719
      },
      {
        "x": 2025,
        "y": 1712
      },
      {
        "x": 2067,
        "y": 1719
      },
      {
        "x": 2108,
        "y": 1710
      },
      {
        "x": 2139,
        "y": 1710
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 1906,
      "y": 1710
    }
  },
  {
    "id": "wuyishan",
    "name": "武夷山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2312,
        "y": 1487
      },
      {
        "x": 2295,
        "y": 1510
      },
      {
        "x": 2272,
        "y": 1549
      },
      {
        "x": 2258,
        "y": 1584
      },
      {
        "x": 2233,
        "y": 1620
      },
      {
        "x": 2218,
        "y": 1645
      },
      {
        "x": 2206,
        "y": 1676
      },
      {
        "x": 2186,
        "y": 1707
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2312,
      "y": 1467
    }
  },
  {
    "id": "dabieshan",
    "name": "大别山",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2051,
        "y": 1275
      },
      {
        "x": 2088,
        "y": 1288
      },
      {
        "x": 2114,
        "y": 1306
      },
      {
        "x": 2137,
        "y": 1318
      },
      {
        "x": 2159,
        "y": 1336
      },
      {
        "x": 2180,
        "y": 1357
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2051,
      "y": 1255
    }
  },
  {
    "id": "taiwan",
    "name": "台湾山脉",
    "description": "",
    "targetLevel": "mountains",
    "points": [
      {
        "x": 2547,
        "y": 1673
      },
      {
        "x": 2529,
        "y": 1712
      },
      {
        "x": 2512,
        "y": 1753
      },
      {
        "x": 2494,
        "y": 1791
      }
    ],
    "dropRadius": 50,
    "labelPosition": {
      "x": 2547,
      "y": 1653
    }
  }
];
