window.GEO_DATA = window.GEO_DATA || {};
window.GEO_DATA.regions = [
  {
    "id": "item_22235_24029_30406_22320",
    "name": "四川盆地",
    "description": "",
    "targetLevel": "terrain-regions",
    "boundary": [
      {
        "x": 1421,
        "y": 1328
      },
      {
        "x": 1373,
        "y": 1323
      },
      {
        "x": 1334,
        "y": 1329
      },
      {
        "x": 1316,
        "y": 1379
      },
      {
        "x": 1315,
        "y": 1432
      },
      {
        "x": 1345,
        "y": 1467
      },
      {
        "x": 1390,
        "y": 1481
      },
      {
        "x": 1421,
        "y": 1505
      },
      {
        "x": 1470,
        "y": 1498
      },
      {
        "x": 1522,
        "y": 1482
      },
      {
        "x": 1539,
        "y": 1439
      },
      {
        "x": 1526,
        "y": 1385
      },
      {
        "x": 1497,
        "y": 1356
      },
      {
        "x": 1464,
        "y": 1344
      },
      {
        "x": 1460,
        "y": 1339
      }
    ],
    "center": {
      "x": 1426,
      "y": 1406
    },
    "dropRadius": 50,
    "labelPosition": {
      "x": 1426,
      "y": 1406
    },
    "difficulty": 1
  },
  {
    "id": "item_38738_34255_39640_21407",
    "name": "青藏高原",
    "description": "青藏高原",
    "targetLevel": "terrain-regions",
    "boundary": [
      {
        "x": 846,
        "y": 1185
      },
      {
        "x": 793,
        "y": 1182
      },
      {
        "x": 750,
        "y": 1186
      },
      {
        "x": 745,
        "y": 1193
      },
      {
        "x": 726,
        "y": 1221
      },
      {
        "x": 739,
        "y": 1261
      },
      {
        "x": 776,
        "y": 1290
      },
      {
        "x": 832,
        "y": 1316
      },
      {
        "x": 906,
        "y": 1344
      },
      {
        "x": 999,
        "y": 1362
      },
      {
        "x": 1033,
        "y": 1313
      },
      {
        "x": 1037,
        "y": 1268
      },
      {
        "x": 1005,
        "y": 1234
      },
      {
        "x": 956,
        "y": 1213
      },
      {
        "x": 905,
        "y": 1197
      },
      {
        "x": 875,
        "y": 1196
      }
    ],
    "center": {
      "x": 870,
      "y": 1248
    },
    "dropRadius": 50,
    "labelPosition": {
      "x": 870,
      "y": 1248
    },
    "difficulty": 1
  },
  {
    "id": "qinling",
    "name": "秦岭",
    "description": "南北分界",
    "targetLevel": "terrain-regions",
    "boundary": [
      {
        "x": 1559,
        "y": 1174
      },
      {
        "x": 1516,
        "y": 1160
      },
      {
        "x": 1459,
        "y": 1140
      },
      {
        "x": 1419,
        "y": 1129
      },
      {
        "x": 1384,
        "y": 1150
      },
      {
        "x": 1391,
        "y": 1201
      },
      {
        "x": 1535,
        "y": 1234
      },
      {
        "x": 1636,
        "y": 1246
      },
      {
        "x": 1762,
        "y": 1262
      },
      {
        "x": 1885,
        "y": 1272
      },
      {
        "x": 2000,
        "y": 1263
      },
      {
        "x": 2024,
        "y": 1211
      },
      {
        "x": 1969,
        "y": 1180
      },
      {
        "x": 1806,
        "y": 1168
      },
      {
        "x": 1698,
        "y": 1168
      },
      {
        "x": 1621,
        "y": 1166
      }
    ],
    "center": {
      "x": 1667,
      "y": 1195
    },
    "dropRadius": 50,
    "labelPosition": {
      "x": 1667,
      "y": 1195
    },
    "difficulty": 1
  },
  {
    "id": "item_21326_21271_24179_21407",
    "name": "华北平原",
    "description": "",
    "targetLevel": "terrain-regions",
    "center": {
      "x": 2109,
      "y": 935
    },
    "dropRadius": 90,
    "labelPosition": {
      "x": 2109,
      "y": 935
    },
    "boundary": [],
    "difficulty": 1
  }
];
